artillery/artillery-worker-thread.yaml
config:
  target: http://localhost:3000
  phases:
    - duration: 10s
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 60s
      arrivalRate: 1
      rampTo: 15
      name: Testing
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
      thresholds:
        - http.response_time.p99: 250
        - http.response_time.p95: 250
scenarios:
  - flow:
      - loop:
        - get:
            url: "/worker-thread?q=2"
        - get:
            url: "/worker-thread?q=4"
        - get:
            url: "/worker-thread?q=8"
        - get:
            url: "/worker-thread?q=16"
        - get:
            url: "/worker-thread?q=32"
        count: 100